<?php
//===============================================
//  Файл:           example/module.php
//  Назначение:     Пример модуля системы
//  Разработчик:    InterWave
//  Версия:         1.0
//===============================================
// Проверка доступа к файлу
defined('ROOT') OR exit('Прямой доступ к скрипту запрещен настройками безопасности');

//===============================================
//  Определяем класс
//===============================================
class CBP_Module_example extends BaseModule{
    // Конструктор модуля. Вызывается при его инициализации
    public function __construct($controller, $args = []) {
        parent::__construct($controller, $args); // Запуск конструктора родителя
    }
    
    // Пример работы с модулем
    function doSomething(){
        echo "Вызов модуля прошел успешно";
        exit();
    }
}