<?php
//==============================================================
//  CodeBits Platform
//  Open Source PHP Framework for Applications and Websites
//  by Ilya Rastorguev
//==============================================================
//  Файл:           module.php
//  Назначение:     Базовый модуль
//  Разработчик:    InterWave
//  Версия:         1.0
//==============================================================
// Проверка доступа к файлу
defined('ROOT') OR exit('Прямой доступ к скрипту запрещен настройками безопасности');

//==============================================================
//  Base Module
//==============================================================
//  Базовый модуль, от которого мы наследуем собственные модули
//==============================================================
class BaseModule{
    // Параметры класса
    var $CBP; // Контроллер
    var $params = []; // Параметры
    
    // Конструктор класса
    function __construct($cont, $args = []) {
        $this->CBP = $cont; // Контроллер
        
        // Поиск аргументов функции
        if(isset($args) && is_array($args) && count($args)>0){ // Аргументы есть
            $this->params = array_merge($this->params, $args); // Объединить массивы
        }
    }
}
?>