//=======================================================
//  Файл:           custom.js
//  Разработчик:    CodeBits Interactive
//  Версия:         1.0
//  Назначение:     Custom Website Template Logic
//=======================================================
//  В этом файле вы можете прописывать кастомную логику
//  для шаблона сайта
//=======================================================
//=======================================================
//  Авто-запускаемая функция, хранящая в себе логику,
//  которая инициализируется после загрузки страницы
//=======================================================
(function(){
    // Документ готов к работе
    $(document).on('ready', function(){
        // Инициализация API
        var api = CBAPI.getInstance(); // Получить экземпляр API 
    });
})();