<?php
//==============================================================
//  CodeBits Platform
//  Open Source PHP Framework for Applications and Websites
//  by Ilya Rastorguev
//==============================================================
//  Файл:           index.php
//  Назначение:     Главный исполнительный файл API
//  Разработчик:    InterWave
//  Версия:         1.0
//==============================================================
define("ROOT", __DIR__); // Определить корневую категорию
include(ROOT.'/core/bootstrap.php'); // Подключить ядро
?>